app/Modules/Menu/Models/Menu_model.php

SELECT *
FROM `menu`
WHERE `menu_id` = '0'
---
	function get_all()
	{
		$builder = $this->db->table($this->table)->select('menu.url,menu.text,menu.menu_id,menu.parent,menu.position,parent.text as parent_text,menu.icon,menu.show_in_menu,menu.show_in_dashboard,menu.dashboard_description,menu.admin_only');
		$builder->join("menu parent", "menu.parent = parent.menu_id", "left");
		$builder->orderBy('position', 'asc');
		return $builder->get()->getResult();

SELECT *
FROM `menu`
WHERE `url` = 'operadores'
---
	function get_items($field, $id)
	{
		$builder = $this->db->table($this->table)->select('menu.url,menu.text,menu.menu_id,menu.parent,menu.position,menu.icon,menu.dashboard_description,menu.admin_only');
		$builder->orderBy('position', 'asc');
		$builder->where('parent', $id);
		$builder->where($field, 1);
		if (!$this->admin) {
			$builder->where('admin_only', 0);
		}
		if ($id == 0) {
			$builder->orWhere('parent IS NULL');
		}
		$menu_items = $builder->get()->getResult();

SELECT *
FROM `menu`
WHERE `url` = 'users'
---
	function get_by_url($url)
	{
		$builder = $this->db->table($this->table);
		$builder->where('url', $url);
		return $builder->get()->getRow();