app/Modules/Users/Models/Users_model.php

SELECT COUNT(*) AS `numrows`
FROM `ion_users`
---
    function total_rows($q = NULL, $filter = array())
    {
        $builder = $this->db->table($this->table)->select('ion_users.email,ion_users.active,ion_users.first_name,ion_users.last_name,id');

        if (count($filter) == 2) {
            $builder->where('ion_users.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();
            $builder->like('id', $q);
            $builder->orLike('ion_users.email', $q);
            $builder->orLike('ion_users.active', $q);
            $builder->orLike('ion_users.first_name', $q);
            $builder->orLike('ion_users.last_name', $q);
            $builder->groupEnd();
        }
        return $builder->countAllResults();

SELECT `ion_users`.`username`, `ion_users`.`email`, `ion_users`.`active`, `ion_users`.`first_name`, `ion_users`.`last_name`, `id`, `ion_users`.`dni`
FROM `ion_users`
ORDER BY `id` ASC
 LIMIT 50
SELECT `ion_groups`.`name`
FROM `ion_users_groups`
LEFT JOIN `ion_groups` ON `ion_users_groups`.`group_id` = `ion_groups`.`id`
WHERE `user_id` = '1'
---
    function get_limit_data($limit, $start = 0, $q = NULL, $oc = '', $od = '', $filter = array())
    {
        $builder = $this->db->table($this->table)->select('ion_users.username,ion_users.email,ion_users.active,ion_users.first_name,ion_users.last_name,id, ion_users.dni, ion_users.entrada_manana, ion_users.salida_manana, ion_users.entrada_tarde, ion_users.salida_tarde, ion_users.entrada_verano_manana, ion_users.salida_verano_manana, ion_users.entrada_verano_tarde, ion_users.salida_verano_tarde');


        if (count($filter) == 2) {
            $builder->where('ion_users.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();

            $builder->like('ion_users.id', $q);
            $builder->orLike('ion_users.email', $q);
            $builder->orLike('ion_users.active', $q);
            $builder->orLike('ion_users.first_name', $q);
            $builder->orLike('ion_users.last_name', $q);
            $builder->groupEnd();
        }

        if ($oc != '') {
            $builder->orderBy($oc, $od);
        } else
            $builder->orderBy('id', 'asc');
        $builder->limit($limit, $start);
        $users = $builder->get()->getResult();
        foreach ($users as $user) {
            $builder = $this->db->table('ion_users_groups')->select('ion_groups.name');
            $builder->join("ion_groups", "ion_users_groups.group_id = ion_groups.id", "left");
            $builder->where("user_id", $user->id);
            $user->groups = implode(', ', array_column($builder->get()->getResult(), 'name'));