app/ThirdParty/ion-auth/Models/IonAuthModel.php

UPDATE `ion_users` SET `forgotten_password_selector` = NULL, `forgotten_password_code` = NULL, `forgotten_password_time` = NULL
WHERE `username` = 'pablo'
---
	public function clearRememberCode(string $identity): bool
	{
		if (empty($identity)) {
			return false;
		}

		$data = [
			'remember_selector' => null,
			'remember_code'     => null,
		];

		return $this->db->table($this->tables['users'])->where($this->identityColumn, $identity)->update($data);

SELECT `ion_users_groups`.`group_id` as `id`, `ion_groups`.`name`, `ion_groups`.`description`
FROM `ion_users_groups`
JOIN `ion_groups` ON `ion_users_groups`.`group_id`=`ion_groups`.`id`
WHERE `ion_users_groups`.`user_id` = 1
---
	public function getUsersGroups(int $id = 0)
	{
		$this->triggerEvents('get_users_group');

		// if no id was passed use the current users id
		$id || $id = $this->session->get('user_id');

		$builder = $this->db->table($this->tables['users_groups']);
		return $builder->select($this->tables['users_groups'] . '.' . $this->join['groups'] . ' as id, ' . $this->tables['groups'] . '.name, ' . $this->tables['groups'] . '.description')
			->where($this->tables['users_groups'] . '.' . $this->join['users'], $id)
			->join($this->tables['groups'], $this->tables['users_groups'] . '.' . $this->join['groups'] . '=' . $this->tables['groups'] . '.id')
			->get();