app/Modules/Asistencias/Models/Asistencias_model.php

    function get_jornada($p = null, $q = null,  $usuario_id = null) {
        $builder = $this->db->table($this->table)->select('SUM(asistencias.fechahora_timestamp) as total');
        $builder->where('usuario_id', $usuario_id);
        $builder->groupBy('asistencias.asistenciatipo_id');
        if ($p != null) {
            $builder->like('fechahora', $p);
        }


        return $builder->get()->GetRow();
---
SELECT `asistencias`.*, `asistenciasnombre`.`nombre` as `nombre`
FROM `asistencias`
JOIN `asistenciasnombre` ON `asistenciasnombre`.`asistenciatipo_id` = `asistencias`.`asistenciatipo_id`
WHERE `usuario_id` = '1'
AND  `fechahora` LIKE '%2022-12-23%' ESCAPE '!'
ORDER BY `fechahora` DESC
 LIMIT 1