app/Modules/Operadores/Models/Operadores_model.php

SELECT COUNT(*) AS `numrows`
FROM `operadores`
---
    function total_rows($q = NULL, $tab = NULL, $filter = array())
    {
        $builder = $this->db->table($this->table)->select('operadores.nombre,operadores.apellidos,operadores.dni,operadores.email,operadores.tipo,operadores.operador_id');

        if (count($filter) == 2) {
            $builder->where('operadores.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();
            $builder->like('operador_id', $q);
            $builder->orLike('operadores.nombre', $q);
            $builder->orLike('operadores.apellidos', $q);
            $builder->orLike('operadores.dni', $q);
            $builder->orLike('operadores.email', $q);
            $builder->orLike('operadores.tipo', $q);
            $builder->groupEnd();
        }
        return $builder->countAllResults();

SELECT `operadores`.`nombre`, `operadores`.`apellidos`, `operadores`.`dni`, `operadores`.`email`, `operadores`.`tipo`, `operadores`.`operador_id`
FROM `operadores`
ORDER BY `nombre` ASC
 LIMIT 50
---
    function get_limit_data($limit, $start = 0, $q = NULL, $tab = NULL, $oc = '', $od = '', $filter = array())
    {
        $builder = $this->db->table($this->table)->select('operadores.nombre,operadores.apellidos,operadores.dni,operadores.email,operadores.tipo,operadores.operador_id');


        if (count($filter) == 2) {
            $builder->where('operadores.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();

            $builder->like('operadores.operador_id', $q);
            $builder->orLike('operadores.nombre', $q);
            $builder->orLike('operadores.apellidos', $q);
            $builder->orLike('operadores.dni', $q);
            $builder->orLike('operadores.email', $q);
            $builder->orLike('operadores.tipo', $q);
            $builder->groupEnd();
        }

        if ($oc != '') {
            $builder->orderBy($oc, $od);
        } else
            $builder->orderBy('nombre', 'asc');
        $builder->limit($limit, $start);
        return $builder->get()->getResult();