app/Modules/Proyectos/Models/Proyectos_model.php

SELECT *
FROM `proyectos`
WHERE `proyecto_id` = '9'
---
    function get_all()
    {
        $builder = $this->db->table($this->table)->select('proyectos.titulo,proyectos.descripcion,proyectos.proyecto_id');
        $builder->orderBy($this->id, $this->order);
        return $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `proyectos`
---
    function total_rows($q = NULL, $tab = NULL, $filter = array())
    {
        $builder = $this->db->table($this->table)->select('proyectos.titulo,proyectos.descripcion,proyectos.proyecto_id');

        if (count($filter) == 2) {
            $builder->where('proyectos.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();
            $builder->like('proyecto_id', $q);
            $builder->orLike('proyectos.titulo', $q);
            $builder->orLike('proyectos.descripcion', $q);
            $builder->groupEnd();
        }
        return $builder->countAllResults();

SELECT `proyectos`.`titulo`, `proyectos`.`descripcion`, `proyectos`.`proyecto_id`
FROM `proyectos`
ORDER BY `proyecto_id` ASC
 LIMIT 50
---
    function get_limit_data($limit, $start = 0, $q = NULL, $tab = NULL, $oc = '', $od = '', $filter = array())
    {
        $builder = $this->db->table($this->table)->select('proyectos.titulo,proyectos.descripcion,proyectos.proyecto_id');


        if (count($filter) == 2) {
            $builder->where('proyectos.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();

            $builder->like('proyectos.proyecto_id', $q);
            $builder->orLike('proyectos.titulo', $q);
            $builder->orLike('proyectos.descripcion', $q);
            $builder->groupEnd();
        }

        if ($oc != '') {
            $builder->orderBy($oc, $od);
        } else
            $builder->orderBy('proyecto_id', 'asc');
        $builder->limit($limit, $start);
        return $builder->get()->getResult();