app/Modules/Tareas/Models/Tareas_model.php

    function total_rows($q = NULL, $tab = NULL, $filter = array())
    {
        $builder = $this->db->table($this->table)->select('tareas.proyecto_id,tareas.titulo,tareas.descripcion,tareas.fechaobjetivo,tareas.fechaestimada,tareas.horasestimadas,tareas.fechacomienzo,tareas.fecharealcierre,tareas.horasreales,tareas.estado,tareas.tarea_id');

        if (count($filter) == 2) {
            $builder->where('tareas.' . $filter[0], $filter[1]);
        }
        if (!empty($q)) {
            $builder->groupStart();
            $builder->like('tarea_id', $q);
            $builder->orLike('tareas.proyecto_id', $q);
            $builder->orLike('tareas.titulo', $q);
            $builder->orLike('tareas.descripcion', $q);
            $builder->orLike('tareas.fechaobjetivo', $q);
            $builder->orLike('tareas.fechaestimada', $q);
            $builder->orLike('tareas.horasestimadas', $q);
            $builder->orLike('tareas.fechacomienzo', $q);
            $builder->orLike('tareas.fecharealcierre', $q);
            $builder->orLike('tareas.horasreales', $q);
            $builder->orLike('tareas.estado', $q);
            $builder->groupEnd();
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tareas`