app/Modules/Tareas/Models/Tareas_model.php

    function get_group_id($id)
    {
        $builder = $this->db->table('ion_users_groups')->select('group_id');
        $builder->where('user_id', $id);
        return $builder->get()->getResult();
---
SELECT `group_id`
FROM `ion_users_groups`
WHERE `user_id` = '1'

    function get_limit_data($limit, $start = 0, $q = NULL, $tab = NULL, $oc = '', $od = '', $filter = array(), $usuario_id = null)
    {
        $builder = $this->db->table($this->table)->select('ion_users.first_name AS operador,proyectos.titulo AS proyecto_titulo,tareas.proyecto_id,tareas.titulo,tareas.descripcion,tareas.fechaobjetivo,tareas.fechaestimada,tareas.horasestimadas,tareas.fechacomienzo,tareas.fecharealcierre,tareas.horasreales,tareas.estado,tareas.tarea_id,estados_nombre.nombre AS texto_estado');
---
SELECT `tareas`.`proyecto_id`, `tareas`.`titulo`, `tareas`.`descripcion`, `tareas`.`fechaobjetivo`, `tareas`.`fechaestimada`, `tareas`.`horasestimadas`, `tareas`.`fechacomienzo`, `tareas`.`fecharealcierre`, `tareas`.`horasreales`, `tareas`.`estado`, `tareas`.`tarea_id`
FROM `tareas`
ORDER BY `tarea_id` ASC
 LIMIT 50